04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/hotWire/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

units [mm];

vertices
(
    (-2 -12 -44  ) ( 2  -12 -44  ) (2 -8 -44  ) (-2  -8 -44  )
    (-1 -10   1.5) ( 1  -10   1.5) (1 -8   1.5) (-1  -8   1.5)

    (-2  8  -44  ) ( 2    8 -44  ) (2 12 -44  ) (-2  12 -44  )
    (-1  8    1.5) ( 1    8   1.5) (1 10   1.5) (-1  10   1.5)

    ( 0 -8   -0.2) (-0.2 -8  -0  ) (0 -8   0.2) (0.2 -8  -0  )
    ( 0 -8   -0.1) (-0.1 -8  -0  ) (0 -8   0.1) (0.1 -8  -0  )

    ( 0  8   -0.2) (-0.2  8  -0  ) (0  8   0.2) (0.2  8  -0  )
    ( 0  8   -0.1) (-0.1  8  -0  ) (0  8   0.1) (0.1  8  -0  )
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) (10 10 100) simpleGrading (1 1 0.1)
    hex ( 8  9 10 11 12 13 14 15) (10 10 100) simpleGrading (1 1 0.1)

    hex (16 17 21 20 24 25 29 28) wire (4 4 80) simpleGrading (1 1 1)
    hex (17 18 22 21 25 26 30 29) wire (4 4 80) simpleGrading (1 1 1)
    hex (18 19 23 22 26 27 31 30) wire (4 4 80) simpleGrading (1 1 1)
    hex (19 16 20 23 27 24 28 31) wire (4 4 80) simpleGrading (1 1 1)

    hex (20 21 22 23 28 29 30 31) wire (4 4 80) simpleGrading (1 1 1)
);

edges
(
    arc 16 17 90 (0 1 0)
    arc 17 18 90 (0 1 0)
    arc 18 19 90 (0 1 0)
    arc 19 16 90 (0 1 0)

    arc 24 25 90 (0 1 0)
    arc 25 26 90 (0 1 0)
    arc 26 27 90 (0 1 0)
    arc 27 24 90 (0 1 0)
);

defaultPatch
{
    name    nonCoupleElectrode;
    type    wall;
}

boundary
(
    positive
    {
        type patch;
        faces ((0 1 2 3));
    }
    negative
    {
        type patch;
        faces ((8 9 10 11));
    }
    nonCoupleWire
    {
        type patch;
        faces
        (
            (16 17 25 24)
            (17 18 26 25)
            (18 19 27 26)
            (19 16 24 27)
        );
    }
    merge
    {
        type patch;
        faces
        (
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
            (19 16 20 23)
            (20 21 22 23)
            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
            (27 24 28 31)
            (28 29 30 31)
        );
    }
);

// ************************************************************************* //
