04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/hotWire/0/solid/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [electricPotential];

internalField   uniform 0;

boundaryField
{
    positive
    {
        type            fixedValue;
        value           uniform -0.05;
    }

    negative
    {
        type            fixedValue;
        value           uniform 0.05;
    }

    "(electrode_on_nonCoupleElectrode|wire_on_nonCoupleWire)"
    {
        type            zeroGradient;
        value           $internalField;
    }

    "nonCouple.*"
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
